<?php
$a = 111;
$b = 222;

echo " a = {$a} , b = {$b}";
echo "<br>";

// Первый вариант
$a = $a ^ $b;
$b = $a ^ $b;
$a = $a ^ $b;

echo " a = {$a} , b = {$b}";
echo "<br>";

// Варианты в одну строку.
// Тут используется следующая особенность. Если в выражении есть нескольких операторов присваивания, то они выполнюятся справа налево.
// Сначала происходит присвоение переменной $b значения %a, потом происходит вычисления выражения и потом переменной $a присваивается результат вычисления.

// Вариант 1
// $a = $a + $b - ($b = $a);

// Вариант 2
$a = $a ^ $b ^ ($b = $a);

echo " a = {$a} , b = {$b}";